Обработки/Reports/_ОтчетПоАктивамВПортфеле_Атомгарант.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетПоАктивамВПортфеле_Атомгарант</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантФормирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетПоАктивамВПортфеле_Атомгарант/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Отчет по активам в портфеле (Атомгарант)",
		"0.07",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Функция ПолучитьПараметрыВыполненияДляСбораСтатистики()
	
	СтрСохраняемыеДанные = "Период,Организация," + ?(ЭтотОбъект.ВариантФормирования = 0, "СчетДоверительногоУправления" ,"Клиент,ВидДоговораДоверительногоУправления");
	ПараметрыОтчета = Новый Структура(СтрСохраняемыеДанные);
	ЗаполнитьЗначенияСвойств(ПараметрыОтчета, ЭтотОбъект);
	
	Описание = "";
	
	Для каждого Реквизит Из СтрРазделить(СтрСохраняемыеДанные, ",") Цикл
	
		Описание = Описание + Символы.ПС + Реквизит + ": " + ПараметрыОтчета[Реквизит];
	
	КонецЦикла; 
	
	Описание = Сред(Описание, 2);
	
	Хранилище = Новый ХранилищеЗначения(ПараметрыОтчета, Новый СжатиеДанных(9));
	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание", Хранилище, Описание);
	
	Возврат ПараметрыВыполненияДляСбораСтатистики;
	
КонецФункции // ПолучитьПараметрыВыполненияДляСбораСтатистики

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	//Если ЭтотОбъект.ВФорматеCSV Тогда
	//	Если Не ПроверитьКаталог() Тогда
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выгрузка отменена");
	//		СтандартнаяОбработка = Ложь;
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;

	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПредопределенногоВарианта = РаботаСОтчетамиКлиентСервер.ПолучитьИмяПредопределенногоВариантаОтчета(ЭтотОбъект);
			
	Настройки = КомпоновщикНастроек.Настройки;
	Параметры = Настройки.ПараметрыДанных;
	
	// Фиксируем старт операции
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,ВариантФормирования,СчетДоверительногоУправления,Клиент,ВидДоговораДоверительногоУправления");	
	ПолноеИмяОтчета = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПриКомпоновкеРезультата()";
	СессияСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		ПолноеИмяОтчета,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	МВТРезультата = ПолучитьРезультатЗапроса();
	
	ЦенныеБумаги 	= МВТРезультата.Таблицы["_Результат_ЦенныеБумаги"].ПолучитьДанные().Выгрузить();
	ПрочиеАктивы 	= МВТРезультата.Таблицы["_Результат_ПрочиеАктивы"].ПолучитьДанные().Выгрузить();
	ОсновныеДанные 	= МВТРезультата.Таблицы["_СчетаДоверительногоУправления"].ПолучитьДанные().Выгрузить();
	
	Если ОсновныеДанные.Количество() = 0 Тогда		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для вывода в отчет");
	Иначе
		
		Макет = ПолучитьМакет("Макет");
	
		ОбластьШапка 		= Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока 		= Макет.ПолучитьОбласть("Строка");
		ОбластьПрочиеАктивы = Макет.ПолучитьОбласть("ПрочиеАктивы");
		
		НаименованиеКлиентаИПортфеля =  ОсновныеДанные[0].НаименованиеКлиента;
		Если ЭтотОбъект.ВариантФормирования = 0 Тогда
			ТекВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления");
			НаименованиеКлиентаИПортфеля = НаименованиеКлиентаИПортфеля + " по договору № " + ОсновныеДанные[0].НомерДоговора + " от "  + Формат(ОсновныеДанные[0].ДатаЗаключения, "ДФ=dd.MM.yyyy") + " г.";
		Иначе
			ТекВидДоговора = ЭтотОбъект.ВидДоговораДоверительногоУправления;
		КонецЕсли;
		
		Если ТекВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями Тогда
			СтрВидДоговора = "средств пенсионных накоплений";
		ИначеЕсли ТекВидДоговора = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами Тогда
			СтрВидДоговора = "средств пенсионных резервов";
		Иначе
			СтрВидДоговора = "собственных средств";
		КонецЕсли;
		
		ОбластьШапка.Параметры.ДатаОтчета = Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yyyy");
		ОбластьШапка.Параметры.ВидДоговора = СтрВидДоговора;
		ОбластьШапка.Параметры.НаименованиеКлиентаИПортфеля = НаименованиеКлиентаИПортфеля;
		
		ДокументРезультат.Вывести(ОбластьШапка);
		Для Каждого ТекСтрока Из ЦенныеБумаги Цикл
			
			ОбластьСтрока.Параметры.Заполнить(ТекСтрока);
			ДокументРезультат.Вывести(ОбластьСтрока);
			
		КонецЦикла;
		
		ДокументРезультат.Вывести(ОбластьПрочиеАктивы);
		
		Для Каждого ТекСтрока Из ПрочиеАктивы Цикл
			
			ОбластьСтрока.Параметры.Заполнить(ТекСтрока);
			
			Если ТипЗнч(ТекСтрока.КодАктива) = Тип("ДокументСсылка.МНО") Тогда
				ОбластьСтрока.Параметры.КодАктива = ПолучитьПредставлениеМНО(ТекСтрока.КодАктива);
			КонецЕсли;
				
			Если ТипЗнч(ТекСтрока.КодАктива_ДатаДоп) = Тип("Дата") Тогда
				ОбластьСтрока.Параметры.КодАктива = СтрЗаменить(ОбластьСтрока.Параметры.КодАктива, "<КодАктива_ДатаДоп>", Формат(ТекСтрока.КодАктива_ДатаДоп, "ДФ=dd.MM.yyyy"));
			КонецЕсли;
			
			Если ТипЗнч(ТекСтрока.КодАктива_Дата) = Тип("Дата") Тогда
				ОбластьСтрока.Параметры.КодАктива = СтрЗаменить(ОбластьСтрока.Параметры.КодАктива, "<КодАктива_Дата>", Формат(ТекСтрока.КодАктива_Дата, "ДФ=dd.MM.yyyy"));
			КонецЕсли;
			
			ДокументРезультат.Вывести(ОбластьСтрока);
			
		КонецЦикла;
		
	КонецЕсли;

	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(ПолноеИмяОтчета, СессияСбораСтатистики);
	
КонецПроцедуры

Функция ПолучитьПредставлениеМНО(МНО)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МНО.РасчетныйСчет.ДоговорМНО.НомерДоговора КАК НомерДоговораМНО,
		|	НомераОбъектов.Номер КАК НомерПодтверждения
		|ИЗ
		|	Документ.МНО КАК МНО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НомераОбъектов КАК НомераОбъектов
		|		ПО МНО.Организация = НомераОбъектов.Организация
		|			И МНО.СчетДоверительногоУправления = НомераОбъектов.СчетДоверительногоУправления
		|			И МНО.Основание = НомераОбъектов.Объект
		|			И (ГОД(МНО.Дата) = НомераОбъектов.Год)
		|			И (НомераОбъектов.ВидНумерации = ЗНАЧЕНИЕ(Справочник.ВидыНумерацииОбъектов.РаспоряженияНаМНО))
		|ГДЕ
		|	МНО.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", МНО);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат "Ген.согл.МНО №" + Выборка.НомерДоговораМНО + " от <КодАктива_Дата> г. Подтв. №" 
				+ РаботаСоСтрокамиКлиентСервер.СократитьЛидирующиеНули(Выборка.НомерПодтверждения) + " от <КодАктива_ДатаДоп> г.";		
	КонецЕсли;
		
КонецФункции

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	Возврат Настройки;

КонецФункции

Функция ПолучитьРезультатЗапроса()
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Период",									НачалоДня(ЭтотОбъект.Период));
	Запрос.УстановитьПараметр("Организация", 							ЭтотОбъект.Организация);	
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 			ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Клиент", 								ЭтотОбъект.Клиент);
	Запрос.УстановитьПараметр("ВидДоговораДоверительногоУправления",	ЭтотОбъект.ВидДоговораДоверительногоУправления);
	Запрос.УстановитьПараметр("ВариантФормирования", 					ЭтотОбъект.ВариантФормирования);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицАнкетныеСрезПоследних.КраткоеНаименованиеПоУставу, """") КАК НаименованиеКлиента
		|ПОМЕСТИТЬ _СчетаДоверительногоУправления
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&Период,
		|			ВЫБОР
		|					КОГДА &ВариантФормирования = 0
		|						ТОГДА СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					ИНАЧЕ Клиент = &Клиент
		|							И СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = &ВидДоговораДоверительногоУправления
		|				КОНЕЦ
		|				И (СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ СчетДоверительногоУправления.ДатаРасторжения >= &Период)) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СтоимостьПереоценки.Рынок КАК Рынок,
		|	ВЫРАЗИТЬ(СтоимостьПереоценки.Цена КАК ЧИСЛО(27, 12)) КАК Стоимость,
		|	СтоимостьПереоценки.ВидЦены КАК ВидЦены,
		|	СтоимостьПереоценки.УровеньОценки КАК УровеньОценки,
		|	СтоимостьПереоценки.ДатаЦены КАК ДатаЦены,
		|	СтоимостьПереоценки.Источник КАК Источник,
		|	СтоимостьПереоценки.РучнойВвод КАК РучнойВвод,
		|	СтоимостьПереоценки.ВидЦеныОценки КАК ВидЦеныОценки,
		|	СУММА(СтоимостьПереоценки.СуммаВВалютеУчета) КАК Сумма,
		|	СУММА(СтоимостьПереоценки.СуммаКупонаВВалютеУчета) КАК Купон,
		|	СУММА(СтоимостьПереоценки.Количество) КАК Количество,
		|	СУММА(СтоимостьПереоценки.СуммаКупонаВВалютеУчета + СтоимостьПереоценки.СуммаВВалютеУчета) КАК ИтогоРынок,
		|	СтоимостьПереоценки.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _ТаблицаЦБ
		|ИЗ
		|	РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
		|ГДЕ
		|	СтоимостьПереоценки.Период = &Период
		|	И СтоимостьПереоценки.Организация = &Организация
		|	И СтоимостьПереоценки.СчетДоверительногоУправления В
		|			(ВЫБРАТЬ
		|				_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|			ИЗ
		|				_СчетаДоверительногоУправления)
		|	И СтоимостьПереоценки.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|	И СтоимостьПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)
		|	И СтоимостьПереоценки.ВидЦеныОценки = ЗНАЧЕНИЕ(Перечисление.ВидыЦенОценки.ЦенаОценки)
		|
		|СГРУППИРОВАТЬ ПО
		|	СтоимостьПереоценки.ЦеннаяБумага,
		|	СтоимостьПереоценки.Рынок,
		|	СтоимостьПереоценки.ВидЦены,
		|	СтоимостьПереоценки.УровеньОценки,
		|	СтоимостьПереоценки.ДатаЦены,
		|	СтоимостьПереоценки.Источник,
		|	СтоимостьПереоценки.РучнойВвод,
		|	СтоимостьПереоценки.ВидЦеныОценки,
		|	ВЫРАЗИТЬ(СтоимостьПереоценки.Цена КАК ЧИСЛО(27, 12)),
		|	СтоимостьПереоценки.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаЦБ.ЦеннаяБумага КАК НаименованиеАктива,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ТаблицаЦБ.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|			ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо
		|		КОГДА ТИПЗНАЧЕНИЯ(_ТаблицаЦБ.ЦеннаяБумага) = ТИП(Справочник.Доли)
		|			ТОГДА ВЫРАЗИТЬ(_ТаблицаЦБ.ЦеннаяБумага КАК Справочник.Доли).ЮрЛицо
		|		КОГДА ТИПЗНАЧЕНИЯ(_ТаблицаЦБ.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|			ТОГДА ВЫРАЗИТЬ(_ТаблицаЦБ.ЦеннаяБумага КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|		КОГДА ТИПЗНАЧЕНИЯ(_ТаблицаЦБ.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|			ТОГДА ВЫРАЗИТЬ(_ТаблицаЦБ.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.ЮрФизЛицо
		|		КОГДА ТИПЗНАЧЕНИЯ(_ТаблицаЦБ.ЦеннаяБумага) = ТИП(Справочник.ДепозитарныеРасписки)
		|			ТОГДА ВЫРАЗИТЬ(_ТаблицаЦБ.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).Эмитент.ЮрФизЛицо
		|		КОГДА ТИПЗНАЧЕНИЯ(_ТаблицаЦБ.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|			ТОГДА ВЫРАЗИТЬ(_ТаблицаЦБ.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.ЮрФизЛицо
		|		КОГДА ТИПЗНАЧЕНИЯ(_ТаблицаЦБ.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(_ТаблицаЦБ.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК Эмитент,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК НаименованиеКонтрагента,
		|	РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование КАК СокращенноеНаименованиеКонтрагента,
		|	РеквизитыЮридическихЛицСрезПоследних.ИНН КАК ИННЭмитента,
		|	РеквизитыЮридическихЛицСрезПоследних.ОГРН КАК ОГРНКонтрагента,
		|	_ТаблицаЦБ.Сумма + _ТаблицаЦБ.Купон КАК Сумма,
		|	_ТаблицаЦБ.Купон КАК СуммаКупона,
		|	ЕСТЬNULL(_ТаблицаЦБ.ЦеннаяБумага.ГосударственныйРегистрационныйНомер, КодыВТорговыхСистемахISIN.Код) КАК ГосударственныйРегистрационныйНомер,
		|	ТИПЗНАЧЕНИЯ(_ТаблицаЦБ.ЦеннаяБумага) КАК ВидАктива,
		|	_ТаблицаЦБ.Количество КАК Количество,
		|	ЕСТЬNULL(КодыВТорговыхСистемахISIN.Код, """") КАК ISIN,
		|	_ТаблицаЦБ.Купон КАК Купон,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ТаблицаЦБ.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|			ТОГДА ВЫРАЗИТЬ(_ТаблицаЦБ.ЦеннаяБумага КАК Справочник.Векселя).ДатаПогашения
		|		КОГДА ТИПЗНАЧЕНИЯ(_ТаблицаЦБ.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(_ТаблицаЦБ.ЦеннаяБумага КАК Справочник.Облигации).ДатаПогашения
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ДатаПогашения
		|ПОМЕСТИТЬ _РазвернутаяТаблицаСКодами
		|ИЗ
		|	_ТаблицаЦБ КАК _ТаблицаЦБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&Период, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫРАЗИТЬ(_ТаблицаЦБ.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(_ТаблицаЦБ.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|					ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_ТаблицаЦБ.ЦеннаяБумага) = ТИП(Справочник.Доли)
		|					ТОГДА ВЫРАЗИТЬ(_ТаблицаЦБ.ЦеннаяБумага КАК Справочник.Доли).ЮрЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_ТаблицаЦБ.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|					ТОГДА ВЫРАЗИТЬ(_ТаблицаЦБ.ЦеннаяБумага КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_ТаблицаЦБ.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|					ТОГДА ВЫРАЗИТЬ(_ТаблицаЦБ.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_ТаблицаЦБ.ЦеннаяБумага) = ТИП(Справочник.ДепозитарныеРасписки)
		|					ТОГДА ВЫРАЗИТЬ(_ТаблицаЦБ.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_ТаблицаЦБ.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|					ТОГДА ВЫРАЗИТЬ(_ТаблицаЦБ.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_ТаблицаЦБ.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|					ТОГДА ВЫРАЗИТЬ(_ТаблицаЦБ.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|			КОНЕЦ = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыБиржи
		|		ПО _ТаблицаЦБ.Источник = РеквизитыБиржи.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&Период, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахISIN
		|		ПО _ТаблицаЦБ.ЦеннаяБумага = КодыВТорговыхСистемахISIN.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(&Период, ) КАК НоминалыЦенныхБумагСрезПоследних
		|		ПО _ТаблицаЦБ.ЦеннаяБумага = НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива КАК ВидАктива,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики КАК СубъектАналитики,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Контрагент КАК Контрагент,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание КАК Основание,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности КАК ВидЗадолженности,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета КАК СуммаРынокВВалютеУчета,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта КАК Валюта
		|ПОМЕСТИТЬ _ПрочиеАктивы
		|ИЗ
		|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|ГДЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период = &Период
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация = &Организация
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления В
		|			(ВЫБРАТЬ
		|				_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|			ИЗ
		|				_СчетаДоверительногоУправления)
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива <> ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма
		|ПОМЕСТИТЬ _ОбщаяСумма
		|ИЗ
		|	(ВЫБРАТЬ
		|		СУММА(_РазвернутаяТаблицаСКодами.Сумма) КАК Сумма
		|	ИЗ
		|		_РазвернутаяТаблицаСКодами КАК _РазвернутаяТаблицаСКодами
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СУММА(_ПрочиеАктивы.СуммаРынокВВалютеУчета)
		|	ИЗ
		|		_ПрочиеАктивы КАК _ПрочиеАктивы) КАК ВложенныйЗапрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ПрочиеАктивы.Основание) = ТИП(Документ.ПогашениеКупона)
		|			ТОГДА ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеКупона).Облигация.Эмитент.ЮрФизЛицо
		|		ИНАЧЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|	КОНЕЦ КАК Эмитент,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ПрочиеАктивы.Основание) = ТИП(Документ.ПогашениеКупона)
		|			ТОГДА ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеКупона).Облигация
		|		ИНАЧЕ ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага
		|	КОНЕЦ КАК Облигация,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ПрочиеАктивы.Основание) = ТИП(Документ.ПогашениеКупона)
		|			ТОГДА ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеКупона).Облигация.ГосударственныйРегистрационныйНомер
		|		ИНАЧЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
		|	КОНЕЦ КАК ГосударственныйРегистрационныйНомер,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ПрочиеАктивы.Основание) = ТИП(Документ.ПогашениеКупона)
		|			ТОГДА ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеКупона).Количество
		|		ИНАЧЕ ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеЦеннойБумаги).Количество
		|	КОНЕЦ КАК Количество,
		|	СУММА(_ПрочиеАктивы.СуммаРынокВВалютеУчета) КАК Сумма
		|ПОМЕСТИТЬ _ДЗПоКупонномуДоходуПоОблигациям
		|ИЗ
		|	_ПрочиеАктивы КАК _ПрочиеАктивы
		|ГДЕ
		|	_ПрочиеАктивы.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|	И _ПрочиеАктивы.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ПрочиеАктивы.Основание) = ТИП(Документ.ПогашениеКупона)
		|			ТОГДА ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеКупона).Облигация.Эмитент.ЮрФизЛицо
		|		ИНАЧЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ПрочиеАктивы.Основание) = ТИП(Документ.ПогашениеКупона)
		|			ТОГДА ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеКупона).Количество
		|		ИНАЧЕ ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеЦеннойБумаги).Количество
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ПрочиеАктивы.Основание) = ТИП(Документ.ПогашениеКупона)
		|			ТОГДА ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеКупона).Облигация
		|		ИНАЧЕ ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ПрочиеАктивы.Основание) = ТИП(Документ.ПогашениеКупона)
		|			ТОГДА ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеКупона).Облигация.ГосударственныйРегистрационныйНомер
		|		ИНАЧЕ ВЫРАЗИТЬ(ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага КАК Справочник.Векселя).Эмитент.ЮрФизЛицо
		|		КОГДА ТИПЗНАЧЕНИЯ(ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.ЮрФизЛицо
		|		КОГДА ТИПЗНАЧЕНИЯ(ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|		КОГДА ТИПЗНАЧЕНИЯ(ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага) = ТИП(Справочник.Паи)
		|			ТОГДА РеквизитыПИФ.УправляющаяКомпания.ЮрФизЛицо
		|	КОНЕЦ КАК Эмитент,
		|	ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(_ПрочиеАктивы.СуммаРынокВВалютеУчета) КАК Сумма,
		|	СУММА(ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеЦеннойБумаги).Количество) КАК Количество
		|ПОМЕСТИТЬ _ДЗПоПогашениюЦенныхБумаг
		|ИЗ
		|	_ПрочиеАктивы КАК _ПрочиеАктивы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&Период, ) КАК РеквизитыПИФ
		|		ПО (ВЫРАЗИТЬ(ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФ.ПаевойИнвестиционныйФонд)
		|ГДЕ
		|	_ПрочиеАктивы.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|	И _ПрочиеАктивы.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюВекселя), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюИпотечногоСертификатаУчастия), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюПая), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага КАК Справочник.Векселя).Эмитент.ЮрФизЛицо
		|		КОГДА ТИПЗНАЧЕНИЯ(ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.ЮрФизЛицо
		|		КОГДА ТИПЗНАЧЕНИЯ(ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|		КОГДА ТИПЗНАЧЕНИЯ(ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага) = ТИП(Справочник.Паи)
		|			ТОГДА РеквизитыПИФ.УправляющаяКомпания.ЮрФизЛицо
		|	КОНЕЦ,
		|	ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПрочиеАктивы.СубъектАналитики КАК МНО,
		|	ВЫРАЗИТЬ(_ПрочиеАктивы.СубъектАналитики КАК Документ.МНО).РасчетныйСчет.Банк.ЮрФизЛицо КАК Контрагент
		|ПОМЕСТИТЬ _КонтрагентыИзМНО
		|ИЗ
		|	_ПрочиеАктивы КАК _ПрочиеАктивы
		|ГДЕ
		|	_ПрочиеАктивы.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|	И ТИПЗНАЧЕНИЯ(_ПрочиеАктивы.СубъектАналитики) = ТИП(Документ.МНО)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПрочиеАктивы.ВидАктива КАК ВидАктива,
		|	_ПрочиеАктивы.ВидЗадолженности КАК ВидЗадолженности,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ПрочиеАктивы.СубъектАналитики) = ТИП(Документ.МНО)
		|			ТОГДА _ПрочиеАктивы.СубъектАналитики
		|		КОГДА _ПрочиеАктивы.СубъектАналитики = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ДенежныеСредстваВПути)
		|			ТОГДА _ПрочиеАктивы.СубъектАналитики
		|		ИНАЧЕ _ПрочиеАктивы.Контрагент
		|	КОНЕЦ КАК СубъектАналитики,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ПрочиеАктивы.СубъектАналитики) = ТИП(Документ.МНО)
		|			ТОГДА _КонтрагентыИзМНО.Контрагент
		|		ИНАЧЕ _ПрочиеАктивы.Контрагент
		|	КОНЕЦ КАК Контрагент,
		|	СУММА(_ПрочиеАктивы.СуммаРынокВВалютеУчета) КАК Сумма
		|ПОМЕСТИТЬ _Секция_6_6_Суммы
		|ИЗ
		|	_ПрочиеАктивы КАК _ПрочиеАктивы
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КонтрагентыИзМНО КАК _КонтрагентыИзМНО
		|		ПО _ПрочиеАктивы.СубъектАналитики = _КонтрагентыИзМНО.МНО
		|ГДЕ
		|	(_ПрочиеАктивы.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|				И НЕ _ПрочиеАктивы.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюВекселя), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюИпотечногоСертификатаУчастия), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюПая), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации))
		|				И ТИПЗНАЧЕНИЯ(_ПрочиеАктивы.СубъектАналитики) <> ТИП(Справочник.БрокерскиеКомпании)
		|			ИЛИ _ПрочиеАктивы.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|				И _ПрочиеАктивы.СубъектАналитики = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ДенежныеСредстваВПути))
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПрочиеАктивы.ВидАктива,
		|	_ПрочиеАктивы.ВидЗадолженности,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ПрочиеАктивы.СубъектАналитики) = ТИП(Документ.МНО)
		|			ТОГДА _ПрочиеАктивы.СубъектАналитики
		|		КОГДА _ПрочиеАктивы.СубъектАналитики = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ДенежныеСредстваВПути)
		|			ТОГДА _ПрочиеАктивы.СубъектАналитики
		|		ИНАЧЕ _ПрочиеАктивы.Контрагент
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ПрочиеАктивы.СубъектАналитики) = ТИП(Документ.МНО)
		|			ТОГДА _КонтрагентыИзМНО.Контрагент
		|		ИНАЧЕ _ПрочиеАктивы.Контрагент
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Денежные средства на расчетном счете"" КАК НаименованиеАктива,
		|	""№ "" + _ПрочиеАктивы.СубъектАналитики.НомерСчета КАК КодАктива,
		|	0 КАК Количество,
		|	""Денежные средства"" КАК ВидАктива,
		|	"""" КАК ДатаПогашения,
		|	_ПрочиеАктивы.СуммаРынокВВалютеУчета КАК Сумма,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК НаименованиеКонтрагента,
		|	РеквизитыЮридическихЛицСрезПоследних.ОГРН КАК ОГРНКонтрагента
		|ПОМЕСТИТЬ _ДенежныеСредства
		|ИЗ
		|	_ПрочиеАктивы КАК _ПрочиеАктивы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО _ПрочиеАктивы.СубъектАналитики.Банк.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|ГДЕ
		|	_ПрочиеАктивы.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|	И _ПрочиеАктивы.СубъектАналитики <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ДенежныеСредстваВПути)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Денежные средства в депозитах"" КАК НаименованиеАктива,
		|	ВЫРАЗИТЬ(_Депозиты.СубъектАналитики КАК Справочник.ДепозитныеВклады).БанковскийСчет.Договор.НомерДоговора + ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(_Депозиты.СубъектАналитики КАК Справочник.ДепозитныеВклады).ДатаПодтверждения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА """"
		|		ИНАЧЕ "" (Подтверждение № "" + ((ВЫРАЗИТЬ(_Депозиты.СубъектАналитики.НомерПодтверждения КАК СТРОКА(10))) + "" от <КодАктива_Дата>"")
		|	КОНЕЦ КАК КодАктива,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(_Депозиты.СубъектАналитики КАК Справочник.ДепозитныеВклады).ДатаПодтверждения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ВЫРАЗИТЬ(_Депозиты.СубъектАналитики КАК Справочник.ДепозитныеВклады).БанковскийСчет.Договор.ДатаЗаключения
		|		ИНАЧЕ ВЫРАЗИТЬ(_Депозиты.СубъектАналитики КАК Справочник.ДепозитныеВклады).ДатаПодтверждения
		|	КОНЕЦ КАК КодАктива_Дата,
		|	0 КАК Количество,
		|	""Денежные средства"" КАК ВидАктива,
		|	УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения,
		|	_Депозиты.СуммаРынокВВалютеУчета + ЕСТЬNULL(_ПроцентыПоДепозитам.СуммаРынокВВалютеУчета, 0) КАК Сумма,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК НаименованиеКонтрагента,
		|	РеквизитыЮридическихЛицСрезПоследних.ОГРН КАК ОГРНКонтрагента
		|ПОМЕСТИТЬ _Депозиты
		|ИЗ
		|	_ПрочиеАктивы КАК _Депозиты
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПрочиеАктивы КАК _ПроцентыПоДепозитам
		|		ПО _Депозиты.СубъектАналитики = _ПроцентыПоДепозитам.СубъектАналитики
		|			И (_ПроцентыПоДепозитам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады))
		|			И (_ПроцентыПоДепозитам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладуПроценты))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ВЫРАЗИТЬ(_Депозиты.СубъектАналитики КАК Справочник.ДепозитныеВклады).БанковскийСчет.Банк.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&Период, Организация = &Организация) КАК УсловияКредитныхИнструментовСрезПоследних
		|		ПО _Депозиты.СубъектАналитики = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|ГДЕ
		|	_Депозиты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|	И _Депозиты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладу)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Денежные средства на брокерском счете"" КАК НаименованиеАктива,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(КодыСчетовДоверительногоУправленияУБрокеров.ДоговорБрокерскогоОбслуживания КАК Справочник.ДоговорыБрокерскогоОбслуживания).НомерДоговора + "" от <КодАктива_Дата>"", ""-"") КАК КодАктива,
		|	ВЫРАЗИТЬ(КодыСчетовДоверительногоУправленияУБрокеров.ДоговорБрокерскогоОбслуживания КАК Справочник.ДоговорыБрокерскогоОбслуживания).ДатаЗаключения КАК КодАктива_Дата,
		|	0 КАК Количество,
		|	""Денежные средства"" КАК ВидАктива,
		|	"""" КАК ДатаПогашения,
		|	_ПрочиеАктивы.СуммаРынокВВалютеУчета КАК Сумма,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК НаименованиеКонтрагента,
		|	РеквизитыЮридическихЛицСрезПоследних.ОГРН КАК ОГРНКонтрагента
		|ПОМЕСТИТЬ _СредстваУБрокера
		|ИЗ
		|	_ПрочиеАктивы КАК _ПрочиеАктивы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ВЫРАЗИТЬ(_ПрочиеАктивы.СубъектАналитики КАК Справочник.БрокерскиеКомпании).ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ДействующиеДоговорыСБрокером.Брокер КАК Брокер,
		|			ДействующиеДоговорыСБрокером.ДоговорБрокерскогоОбслуживания КАК ДоговорБрокерскогоОбслуживания,
		|			ДействующиеДоговорыСБрокером.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|		ИЗ
		|			РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|					&Период,
		|					Организация = &Организация
		|						И СчетДоверительногоУправления В
		|							(ВЫБРАТЬ
		|								_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|							ИЗ
		|								_СчетаДоверительногоУправления)) КАК ДействующиеДоговорыСБрокером
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&Период, ) КАК УсловияДоговоровОбщиеСрезПоследних
		|				ПО ДействующиеДоговорыСБрокером.ДоговорБрокерскогоОбслуживания = УсловияДоговоровОбщиеСрезПоследних.Договор
		|		ГДЕ
		|			(УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
		|					ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения >= &Период
		|					ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))) КАК КодыСчетовДоверительногоУправленияУБрокеров
		|		ПО _ПрочиеАктивы.СубъектАналитики = КодыСчетовДоверительногоУправленияУБрокеров.Брокер
		|			И _ПрочиеАктивы.СчетДоверительногоУправления = КодыСчетовДоверительногоУправленияУБрокеров.СчетДоверительногоУправления
		|ГДЕ
		|	_ПрочиеАктивы.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|	И ТИПЗНАЧЕНИЯ(_ПрочиеАктивы.СубъектАналитики) = ТИП(Справочник.БрокерскиеКомпании)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Дебиторская задолженность"" КАК НаименованиеАктива,
		|	КодыВТорговыхСистемахISIN.Код КАК КодАктива,
		|	""Погашение купона"" КАК ВидАктива,
		|	"""" КАК ДатаПогашения,
		|	_ДЗПоКупонномуДоходуПоОблигациям.Количество КАК Количество,
		|	_ДЗПоКупонномуДоходуПоОблигациям.Сумма КАК Сумма,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК НаименованиеКонтрагента,
		|	РеквизитыЮридическихЛицСрезПоследних.ОГРН КАК ОГРНКонтрагента
		|ПОМЕСТИТЬ _ПогашениеКупона
		|ИЗ
		|	_ДЗПоКупонномуДоходуПоОблигациям КАК _ДЗПоКупонномуДоходуПоОблигациям
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(
		|				&Период,
		|				ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)
		|					И Объект В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							_ДЗПоКупонномуДоходуПоОблигациям.Облигация КАК Облигация
		|						ИЗ
		|							_ДЗПоКупонномуДоходуПоОблигациям КАК _ДЗПоКупонномуДоходуПоОблигациям)) КАК КодыВТорговыхСистемахISIN
		|		ПО _ДЗПоКупонномуДоходуПоОблигациям.Облигация = КодыВТорговыхСистемахISIN.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО _ДЗПоКупонномуДоходуПоОблигациям.Эмитент = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Дебиторская задолженность"" КАК НаименованиеАктива,
		|	КодыВТорговыхСистемахISIN.Код КАК КодАктива,
		|	СУММА(УсловияСделокРЕПОСрезПоследних.Количество) КАК Количество,
		|	УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО КАК ДатаПогашения,
		|	""РЕПО"" КАК ВидАктива,
		|	СУММА(_ПрочиеАктивы.СуммаРынокВВалютеУчета) КАК Сумма,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК НаименованиеКонтрагента,
		|	РеквизитыЮридическихЛицСрезПоследних.ОГРН КАК ОГРНКонтрагента
		|ПОМЕСТИТЬ _РЕПО
		|ИЗ
		|	_ПрочиеАктивы КАК _ПрочиеАктивы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&Период, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахISIN
		|		ПО _ПрочиеАктивы.СубъектАналитики = КодыВТорговыхСистемахISIN.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.СделкаРЕПО).Контрагент = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|				КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
		|				Организация = &Организация
		|					И ЧастьСделкиРЕПО = 1) КАК УсловияСделокРЕПОСрезПоследних
		|		ПО _ПрочиеАктивы.Основание = УсловияСделокРЕПОСрезПоследних.СделкаРЕПО
		|ГДЕ
		|	_ПрочиеАктивы.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|	И _ПрочиеАктивы.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО))
		|	И ТИПЗНАЧЕНИЯ(_ПрочиеАктивы.Основание) = ТИП(Документ.СделкаРЕПО)
		|
		|СГРУППИРОВАТЬ ПО
		|	КодыВТорговыхСистемахISIN.Код,
		|	УсловияСделокРЕПОСрезПоследних.ДатаВторойЧастиРЕПО,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу,
		|	РеквизитыЮридическихЛицСрезПоследних.ОГРН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Дебиторская задолженность"" КАК НаименованиеАктива,
		|	КодыВТорговыхСистемахISIN.Код КАК КодАктива,
		|	""Т+"" КАК ВидАктива,
		|	УсловияСделокСрезПоследних.ДатаИсполнения КАК ДатаПогашения,
		|	СУММА(УсловияСделокСрезПоследних.Количество) КАК Количество,
		|	СУММА(_ПрочиеАктивы.СуммаРынокВВалютеУчета) КАК Сумма,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК НаименованиеКонтрагента,
		|	РеквизитыЮридическихЛицСрезПоследних.ОГРН КАК ОГРНКонтрагента
		|ПОМЕСТИТЬ _ТПлюс
		|ИЗ
		|	_ПрочиеАктивы КАК _ПрочиеАктивы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&Период, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахISIN
		|		ПО _ПрочиеАктивы.СубъектАналитики = КодыВТорговыхСистемахISIN.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок.СрезПоследних(КОНЕЦПЕРИОДА(&Период, ДЕНЬ), Организация = &Организация) КАК УсловияСделокСрезПоследних
		|		ПО _ПрочиеАктивы.Основание = УсловияСделокСрезПоследних.Сделка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ВЫРАЗИТЬ(_ПрочиеАктивы.Основание КАК Документ.Сделка).Контрагент = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|ГДЕ
		|	_ПрочиеАктивы.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|	И _ПрочиеАктивы.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|	И ТИПЗНАЧЕНИЯ(_ПрочиеАктивы.Основание) <> ТИП(Документ.СделкаРЕПО)
		|
		|СГРУППИРОВАТЬ ПО
		|	КодыВТорговыхСистемахISIN.Код,
		|	УсловияСделокСрезПоследних.ДатаИсполнения,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу,
		|	РеквизитыЮридическихЛицСрезПоследних.ОГРН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Дебиторская задолженность"" КАК НаименованиеАктива,
		|	КодыВТорговыхСистемахISIN.Код КАК КодАктива,
		|	""Погашение ценной бумаги"" КАК ВидАктива,
		|	"""" КАК ДатаПогашения,
		|	_ДЗПоПогашениюЦенныхБумаг.Сумма КАК Сумма,
		|	_ДЗПоПогашениюЦенныхБумаг.Количество КАК Количество,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК НаименованиеКонтрагента,
		|	РеквизитыЮридическихЛицСрезПоследних.ОГРН КАК ОГРНКонтрагента
		|ПОМЕСТИТЬ _ПогашениеЦБ
		|ИЗ
		|	_ДЗПоПогашениюЦенныхБумаг КАК _ДЗПоПогашениюЦенныхБумаг
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&Период, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахISIN
		|		ПО _ДЗПоПогашениюЦенныхБумаг.ЦеннаяБумага = КодыВТорговыхСистемахISIN.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО _ДЗПоПогашениюЦенныхБумаг.Эмитент = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Дебиторская задолженность"" КАК НаименованиеАктива,
		|	ВЫБОР
		|		КОГДА _Секция_6_6_Суммы.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|				И _Секция_6_6_Суммы.СубъектАналитики = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ДенежныеСредстваВПути)
		|			ТОГДА ""Денежные средства в пути""
		|		КОГДА ТИПЗНАЧЕНИЯ(_Секция_6_6_Суммы.СубъектАналитики) = ТИП(Документ.МНО)
		|			ТОГДА _Секция_6_6_Суммы.СубъектАналитики
		|		ИНАЧЕ _Секция_6_6_Суммы.ВидЗадолженности.Наименование
		|	КОНЕЦ КАК КодАктива,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_Секция_6_6_Суммы.СубъектАналитики) = ТИП(Документ.МНО)
		|			ТОГДА ВЫРАЗИТЬ(_Секция_6_6_Суммы.СубъектАналитики КАК Документ.МНО).РасчетныйСчет.ДоговорМНО.ДатаЗаключения
		|	КОНЕЦ КАК КодАктива_Дата,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_Секция_6_6_Суммы.СубъектАналитики) = ТИП(Документ.МНО)
		|			ТОГДА ВЫРАЗИТЬ(_Секция_6_6_Суммы.СубъектАналитики КАК Документ.МНО).Дата
		|	КОНЕЦ КАК КодАктива_ДатаДоп,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_Секция_6_6_Суммы.СубъектАналитики) = ТИП(Документ.МНО)
		|			ТОГДА ВЫРАЗИТЬ(_Секция_6_6_Суммы.СубъектАналитики КАК Документ.МНО).ДатаВозврата
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ДатаПогашения,
		|	ВЫБОР
		|		КОГДА _Секция_6_6_Суммы.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|				И _Секция_6_6_Суммы.СубъектАналитики = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ДенежныеСредстваВПути)
		|			ТОГДА ""Денежные средства""
		|		КОГДА ТИПЗНАЧЕНИЯ(_Секция_6_6_Суммы.СубъектАналитики) = ТИП(Документ.МНО)
		|			ТОГДА ""МНО""
		|		ИНАЧЕ ""Прочее""
		|	КОНЕЦ КАК ВидАктива,
		|	0 КАК Количество,
		|	_Секция_6_6_Суммы.Сумма КАК Сумма,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК НаименованиеКонтрагента,
		|	РеквизитыЮридическихЛицСрезПоследних.ОГРН КАК ОГРНКонтрагента
		|ПОМЕСТИТЬ _ПрочаяДЗ
		|ИЗ
		|	_Секция_6_6_Суммы КАК _Секция_6_6_Суммы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО _Секция_6_6_Суммы.Контрагент = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.НаименованиеАктива КАК НаименованиеАктива,
		|	ВложенныйЗапрос.КодАктива КАК КодАктива,
		|	ВложенныйЗапрос.Количество КАК Количество,
		|	ВложенныйЗапрос.ВидАктива КАК ВидАктива,
		|	ВложенныйЗапрос.ДатаПогашения КАК ДатаПогашения,
		|	ВложенныйЗапрос.Сумма КАК Сумма,
		|	ВложенныйЗапрос.НаименованиеКонтрагента КАК НаименованиеКонтрагента,
		|	ВложенныйЗапрос.ОГРНКонтрагента КАК ОГРНКонтрагента,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_ОбщаяСумма.Сумма, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(ВложенныйЗапрос.Сумма / _ОбщаяСумма.Сумма * 100 КАК ЧИСЛО(19, 4))
		|	КОНЕЦ КАК Доля
		|ПОМЕСТИТЬ _Результат_ЦенныеБумаги
		|ИЗ
		|	(ВЫБРАТЬ
		|		_РазвернутаяТаблицаСКодами.СокращенноеНаименованиеКонтрагента + "" "" + _РазвернутаяТаблицаСКодами.ГосударственныйРегистрационныйНомер КАК НаименованиеАктива,
		|		_РазвернутаяТаблицаСКодами.ISIN КАК КодАктива,
		|		СУММА(_РазвернутаяТаблицаСКодами.Количество) КАК Количество,
		|		_РазвернутаяТаблицаСКодами.ВидАктива КАК ВидАктива,
		|		_РазвернутаяТаблицаСКодами.ДатаПогашения КАК ДатаПогашения,
		|		СУММА(_РазвернутаяТаблицаСКодами.Сумма) КАК Сумма,
		|		_РазвернутаяТаблицаСКодами.НаименованиеКонтрагента КАК НаименованиеКонтрагента,
		|		_РазвернутаяТаблицаСКодами.ОГРНКонтрагента КАК ОГРНКонтрагента
		|	ИЗ
		|		_РазвернутаяТаблицаСКодами КАК _РазвернутаяТаблицаСКодами
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_РазвернутаяТаблицаСКодами.СокращенноеНаименованиеКонтрагента + "" "" + _РазвернутаяТаблицаСКодами.ГосударственныйРегистрационныйНомер,
		|		_РазвернутаяТаблицаСКодами.ISIN,
		|		_РазвернутаяТаблицаСКодами.ВидАктива,
		|		_РазвернутаяТаблицаСКодами.ДатаПогашения,
		|		_РазвернутаяТаблицаСКодами.НаименованиеКонтрагента,
		|		_РазвернутаяТаблицаСКодами.ОГРНКонтрагента) КАК ВложенныйЗапрос,
		|	_ОбщаяСумма КАК _ОбщаяСумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДенежныеСредства.НаименованиеАктива КАК НаименованиеАктива,
		|	_ДенежныеСредства.КодАктива КАК КодАктива,
		|	СУММА(_ДенежныеСредства.Количество) КАК Количество,
		|	_ДенежныеСредства.ВидАктива КАК ВидАктива,
		|	_ДенежныеСредства.ДатаПогашения КАК ДатаПогашения,
		|	СУММА(_ДенежныеСредства.Сумма) КАК Сумма,
		|	_ДенежныеСредства.НаименованиеКонтрагента КАК НаименованиеКонтрагента,
		|	_ДенежныеСредства.ОГРНКонтрагента КАК ОГРНКонтрагента,
		|	"""" КАК КодАктива_Дата,
		|	"""" КАК КодАктива_ДатаДоп
		|ПОМЕСТИТЬ _Результат_ПрочиеАктивыРазвернуто
		|ИЗ
		|	_ДенежныеСредства КАК _ДенежныеСредства
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДенежныеСредства.НаименованиеАктива,
		|	_ДенежныеСредства.КодАктива,
		|	_ДенежныеСредства.ВидАктива,
		|	_ДенежныеСредства.ДатаПогашения,
		|	_ДенежныеСредства.НаименованиеКонтрагента,
		|	_ДенежныеСредства.ОГРНКонтрагента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Депозиты.НаименованиеАктива,
		|	_Депозиты.КодАктива,
		|	СУММА(_Депозиты.Количество),
		|	_Депозиты.ВидАктива,
		|	_Депозиты.ДатаПогашения,
		|	СУММА(_Депозиты.Сумма),
		|	_Депозиты.НаименованиеКонтрагента,
		|	_Депозиты.ОГРНКонтрагента,
		|	_Депозиты.КодАктива_Дата,
		|	NULL
		|ИЗ
		|	_Депозиты КАК _Депозиты
		|
		|СГРУППИРОВАТЬ ПО
		|	_Депозиты.НаименованиеАктива,
		|	_Депозиты.КодАктива,
		|	_Депозиты.ВидАктива,
		|	_Депозиты.ДатаПогашения,
		|	_Депозиты.НаименованиеКонтрагента,
		|	_Депозиты.ОГРНКонтрагента,
		|	_Депозиты.КодАктива_Дата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_СредстваУБрокера.НаименованиеАктива,
		|	_СредстваУБрокера.КодАктива,
		|	СУММА(_СредстваУБрокера.Количество),
		|	_СредстваУБрокера.ВидАктива,
		|	_СредстваУБрокера.ДатаПогашения,
		|	СУММА(_СредстваУБрокера.Сумма),
		|	_СредстваУБрокера.НаименованиеКонтрагента,
		|	_СредстваУБрокера.ОГРНКонтрагента,
		|	_СредстваУБрокера.КодАктива_Дата,
		|	NULL
		|ИЗ
		|	_СредстваУБрокера КАК _СредстваУБрокера
		|
		|СГРУППИРОВАТЬ ПО
		|	_СредстваУБрокера.НаименованиеАктива,
		|	_СредстваУБрокера.КодАктива,
		|	_СредстваУБрокера.ВидАктива,
		|	_СредстваУБрокера.ДатаПогашения,
		|	_СредстваУБрокера.НаименованиеКонтрагента,
		|	_СредстваУБрокера.ОГРНКонтрагента,
		|	_СредстваУБрокера.КодАктива_Дата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ПогашениеКупона.НаименованиеАктива,
		|	_ПогашениеКупона.КодАктива,
		|	СУММА(_ПогашениеКупона.Количество),
		|	_ПогашениеКупона.ВидАктива,
		|	_ПогашениеКупона.ДатаПогашения,
		|	СУММА(_ПогашениеКупона.Сумма),
		|	_ПогашениеКупона.НаименованиеКонтрагента,
		|	_ПогашениеКупона.ОГРНКонтрагента,
		|	NULL,
		|	NULL
		|ИЗ
		|	_ПогашениеКупона КАК _ПогашениеКупона
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПогашениеКупона.НаименованиеАктива,
		|	_ПогашениеКупона.КодАктива,
		|	_ПогашениеКупона.ВидАктива,
		|	_ПогашениеКупона.ДатаПогашения,
		|	_ПогашениеКупона.НаименованиеКонтрагента,
		|	_ПогашениеКупона.ОГРНКонтрагента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_РЕПО.НаименованиеАктива,
		|	_РЕПО.КодАктива,
		|	СУММА(_РЕПО.Количество),
		|	_РЕПО.ВидАктива,
		|	_РЕПО.ДатаПогашения,
		|	СУММА(_РЕПО.Сумма),
		|	_РЕПО.НаименованиеКонтрагента,
		|	_РЕПО.ОГРНКонтрагента,
		|	NULL,
		|	NULL
		|ИЗ
		|	_РЕПО КАК _РЕПО
		|
		|СГРУППИРОВАТЬ ПО
		|	_РЕПО.НаименованиеАктива,
		|	_РЕПО.КодАктива,
		|	_РЕПО.ВидАктива,
		|	_РЕПО.ДатаПогашения,
		|	_РЕПО.НаименованиеКонтрагента,
		|	_РЕПО.ОГРНКонтрагента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ТПлюс.НаименованиеАктива,
		|	_ТПлюс.КодАктива,
		|	СУММА(_ТПлюс.Количество),
		|	_ТПлюс.ВидАктива,
		|	_ТПлюс.ДатаПогашения,
		|	СУММА(_ТПлюс.Сумма),
		|	_ТПлюс.НаименованиеКонтрагента,
		|	_ТПлюс.ОГРНКонтрагента,
		|	NULL,
		|	NULL
		|ИЗ
		|	_ТПлюс КАК _ТПлюс
		|
		|СГРУППИРОВАТЬ ПО
		|	_ТПлюс.НаименованиеАктива,
		|	_ТПлюс.КодАктива,
		|	_ТПлюс.ВидАктива,
		|	_ТПлюс.ДатаПогашения,
		|	_ТПлюс.НаименованиеКонтрагента,
		|	_ТПлюс.ОГРНКонтрагента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ПогашениеЦБ.НаименованиеАктива,
		|	_ПогашениеЦБ.КодАктива,
		|	СУММА(_ПогашениеЦБ.Количество),
		|	_ПогашениеЦБ.ВидАктива,
		|	_ПогашениеЦБ.ДатаПогашения,
		|	СУММА(_ПогашениеЦБ.Сумма),
		|	_ПогашениеЦБ.НаименованиеКонтрагента,
		|	_ПогашениеЦБ.ОГРНКонтрагента,
		|	NULL,
		|	NULL
		|ИЗ
		|	_ПогашениеЦБ КАК _ПогашениеЦБ
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПогашениеЦБ.НаименованиеАктива,
		|	_ПогашениеЦБ.КодАктива,
		|	_ПогашениеЦБ.ВидАктива,
		|	_ПогашениеЦБ.ДатаПогашения,
		|	_ПогашениеЦБ.НаименованиеКонтрагента,
		|	_ПогашениеЦБ.ОГРНКонтрагента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ПрочаяДЗ.НаименованиеАктива,
		|	_ПрочаяДЗ.КодАктива,
		|	СУММА(_ПрочаяДЗ.Количество),
		|	_ПрочаяДЗ.ВидАктива,
		|	_ПрочаяДЗ.ДатаПогашения,
		|	СУММА(_ПрочаяДЗ.Сумма),
		|	_ПрочаяДЗ.НаименованиеКонтрагента,
		|	_ПрочаяДЗ.ОГРНКонтрагента,
		|	_ПрочаяДЗ.КодАктива_Дата,
		|	_ПрочаяДЗ.КодАктива_ДатаДоп
		|ИЗ
		|	_ПрочаяДЗ КАК _ПрочаяДЗ
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПрочаяДЗ.НаименованиеАктива,
		|	_ПрочаяДЗ.КодАктива,
		|	_ПрочаяДЗ.ВидАктива,
		|	_ПрочаяДЗ.ДатаПогашения,
		|	_ПрочаяДЗ.НаименованиеКонтрагента,
		|	_ПрочаяДЗ.ОГРНКонтрагента,
		|	_ПрочаяДЗ.КодАктива_Дата,
		|	_ПрочаяДЗ.КодАктива_ДатаДоп
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Результат_ПрочиеАктивыРазвернуто.НаименованиеАктива КАК НаименованиеАктива,
		|	_Результат_ПрочиеАктивыРазвернуто.КодАктива КАК КодАктива,
		|	_Результат_ПрочиеАктивыРазвернуто.Количество КАК Количество,
		|	_Результат_ПрочиеАктивыРазвернуто.ВидАктива КАК ВидАктива,
		|	_Результат_ПрочиеАктивыРазвернуто.ДатаПогашения КАК ДатаПогашения,
		|	_Результат_ПрочиеАктивыРазвернуто.Сумма КАК Сумма,
		|	_Результат_ПрочиеАктивыРазвернуто.НаименованиеКонтрагента КАК НаименованиеКонтрагента,
		|	_Результат_ПрочиеАктивыРазвернуто.ОГРНКонтрагента КАК ОГРНКонтрагента,
		|	_Результат_ПрочиеАктивыРазвернуто.КодАктива_Дата КАК КодАктива_Дата,
		|	_Результат_ПрочиеАктивыРазвернуто.КодАктива_ДатаДоп КАК КодАктива_ДатаДоп,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_ОбщаяСумма.Сумма, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(_Результат_ПрочиеАктивыРазвернуто.Сумма / _ОбщаяСумма.Сумма * 100 КАК ЧИСЛО(19, 4))
		|	КОНЕЦ КАК Доля
		|ПОМЕСТИТЬ _Результат_ПрочиеАктивы
		|ИЗ
		|	_Результат_ПрочиеАктивыРазвернуто КАК _Результат_ПрочиеАктивыРазвернуто,
		|	_ОбщаяСумма КАК _ОбщаяСумма";
	
	Запрос.Выполнить();
	
	Возврат Запрос.МенеджерВременныхТаблиц;
		
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ЭтотОбъект.Период = НачалоДня(НастройкиОтчета.Период.ДатаОкончания);
		
	ЭтотОбъект.ВариантФормирования = ?(НастройкиОтчета.ПоКлиенту, 1, 0);
	
	Если ЭтотОбъект.ВариантФормирования = 1 Тогда
		ЭтотОбъект.Клиент = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Период);
		ЭтотОбъект.ВидДоговораДоверительногоУправления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления");
	КонецЕсли;
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	СкомпоноватьРезультат(ДокументРезультат);
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ВариантФормирования = 0 Тогда
		
		ПроверяемыеРеквизиты.Добавить("СчетДоверительногоУправления");
		
		Если ПроверяемыеРеквизиты.Найти("Клиент") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить("Клиент");
		КонецЕсли;
		
		Если ПроверяемыеРеквизиты.Найти("ВидДоговораДоверительногоУправления") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить("ВидДоговораДоверительногоУправления");
		КонецЕсли;
		
	Иначе
		
		ПроверяемыеРеквизиты.Добавить("Клиент");
		ПроверяемыеРеквизиты.Добавить("ВидДоговораДоверительногоУправления");
				
		Если ПроверяемыеРеквизиты.Найти("СчетДоверительногоУправления") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить("СчетДоверительногоУправления");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
